// 별찍기 예제
/*
	*****
	*****
	*****
	*****
	*****

	*
	**
	***
	****
	*****
	등등
*/


#include <stdio.h>

int main() {
	int i, j, k;

	// 5x5 * 찍기
	//for (i = 1; i <= 5; i++) {
	//	// 반목문의 조건만 조절하면 대부분 답이 나옴
	//	for (j = 1; j <= i; j++) {
	//		printf("*");
	//	}
	//	printf("\n");
	//}

	//for (i = 1; i <= 5; i++) {
	//	// k <= 5 - i 핵심
	//	for (k = 1; k <= 5 - i; k++) {
	//		printf(" "); // 빈공백을 추가
	//	}

	//	for (j = 1; j <= i; j++) {
	//		printf("*");
	//	}
	//	printf("\n");
	//}

	for (i = 1; i <= 5; i++) {
		// i + j == 0, 1 ,2 ,3 ,4
		// i, j == 0, 1, 2, 3, 4
		for (j = 1; j <= i + 1; j++) {
			printf("*");
		}
		printf("\n");
	}

	return 0;
}